#camelcase არის ერთ-ერთი case-ი რომელიც შეიძლება ჩაიწეროს შემდეგ ნაირად "nameSurname" გადაბმულად არანაირი შემაერტებელი ნიშნების გარეშე.
#და ასევე "camel case"-ში პირველი ასო არის სულ პატარა ხოლო მომდევნო ყველა სიტყვის პირელი ასო დიდია#გვხვდება პროგრამირების ენებში როგორიცა Javascript და სხვა

#Snake case ასევე ერთ-ერთი case-ი იწერება შემდეგ ნაირად "Name_Surname" აქ უკვე გვაქვს დამაკავშირებელი ნიშანი "_" ქვედა ტირე გვხვდება python-ში

#Kebab case ასევე ერთ-ერთი case-ი იწერება შემდეგ ნაირად "Name-Surname" აქ არის დამაკავშირებელი ნისანი "-" გამოიყენება Java და Javascript-ში

#Pascal case არის case-ი რომელიც ხშირად ერევათ "camel case"- ში. #განსხვავება იმაშია რომ "Pascal case"-ში პირველი და ყოველი მომდევნო ახალი სიტყვის პირველი ასო იწყება დიდი ასთი

#Upper case წააგავს "snake case"-ს ამ case-ში ვიყენებთ "_" განსხვავება "snake case"-ისგან ისაა რომ აქ ყველა ასო უნდა დავწერო დიდი ასოები მაგ "NAME_SURNAME"

#debugging არის კოდში error-ების ანუ იგივე შეცდომის პოვნა და მისი შესწორება. ეს საქმიანობა ძალიან მნიშვნელოვანია რადგან კოდი ვერ იმუშავებს გამართულად თუ იგი არ არის სწორად დაწერილი






#ასევე არსებობს case sensitive და case insensitive-ი . case sensitive-ნიშნავს რომ "P"სა და "p"ს შორის არის განსხვავება და კომპიუტერი აღიქვამს ორ სხვადასხვა ნიშნად
#ხოლო case insensitive არის სრულად განსხვავებული სადა "P"სა და "p"-ს შორის კომპიუტერი განსხვავებას ვერ ამჩნევს და ერთი და იგივე ნიშნად აღიქვამს
#case sensitive გვხვდება ისეთ პროგრამირების ენებში როგორიცაა Java C# და XML
#case insensitive გვხვდება HTML CSS