"""
მონაცემები იყოფა 2 ნაწილად ტექსტური ინფორმაცია და რიცხვული ინფორმაცია
ტექსტურ ინფორმაციას ქვია stirng(str)
ხოლო ციფრული ინფორმაცია იყოფა კიდე ორ ნაწილად მთელი(integer(int)) და ათწილადი(float)

/- სიმბოლო რომელსაც გამოვიყენებთ გაყოფისთვის ხოლო %-ს გამოვიყენებტ ნაშტიანი გაყოფისთვის
მაგალითად 6/3 იქნება 2. ხოლო 6%3 იქნება 0 რადგან ნაშტი რჩება ნული 
"""

print(91+3)
print(87+ 93)
print(23+92)

print(93-3)
print(86-40)
print(732-321)

print(32*12)
print(9*11)
print(21*7)

print(87/32)
print(9/3)
print(125/5)

print(71%23)
print(52%21)
print(121%11)

print(5**2)
print(11**3)
print(2**6)








